Public Attributes | List of all members
API_MorphType Struct Reference
Element Manager API
Represents a morph element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
bool  | isAutoOnStoryVisibility
Is Auto On Story Visibility.
API_StoryVisibility  | showContour
The option to define which stories display the contour of the morph.
API_StoryVisibility  | showFill
The option to define which stories display the fill of the morph.
API_LinkToSettings  | linkToSettings
Mode of linking to home story.
API_ElemDisplayOptionsID  | displayOption
Display options of the element on the floor plan (see API_ElemDisplayOptionsID).
API_ElemViewDepthLimitationsID  | viewDepthLimitation
Defines the range within the element is shown on the floor plan (see API_ElemViewDepthLimitationsID).
API_AttributeIndex  | buildingMaterial
Building Material index of morph's hatch.
API_OverriddenPen  | cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
API_AttributeIndex  | cutLineType
Line Type of the cut contour.
short  | cutLinePen
Pen of the cut contour.
short  | uncutLinePen
Pen of the contour.
API_AttributeIndex  | uncutLineType
Line Type of the contour.
API_AttributeIndex  | overheadLineType
Line Type of view above (Floor plan only).
short  | overheadLinePen
Pen of view above (Floor plan only).
bool  | useCoverFillType
Use Floor plan fill.
bool  | outlineContourDisplay
Outline Contour Display.
API_AttributeIndex  | coverFillType
Floor plan fill type.
short  | coverFillPen
Floor plan fill pen.
short  | coverFillBGPen
Floor plan fill background pen.
bool  | use3DHatching
Floor plan fill from material.
API_HatchOrientation  | coverFillOrientation
Floor plan local origo type of fill.
bool  | useDistortedCoverFill
Show hatching as projected onto a plane.
API_OverriddenAttribute  | material
Material override structure of non customized surfaces.
API_TextureProjectionTypeID  | textureProjectionType
Projection type of texture.
API_Coord3D  | textureProjectionCoords [4]
Texture projection coordinate system.
double  | level
Z position of the free shape.
API_MorphBodyTypeID  | bodyType
Type of the body (Solid, Surface).
API_MorphEdgeTypeID  | edgeType
Type of the edge (Soft, Sharp).
bool  | castShadow
Body casts shadow.
bool  | receiveShadow
Body receives shadow.
API_Tranmat  | tranmat
Tranmat of the morph element.
Detailed Description
Represents a morph element.
Remarks
The elements' cut fill foreground and background pens inherit from the building material, and can be overridden on the element level. The elements' surface materials inherit from the building material, and can be overridden on the element level. For morph related memo data see the ACAPI_Element_GetMemo function. For mesh related memo data see the ACAPI_Element_GetMemo function. The elements' surface materials inherit from the building material, and can be overridden on the element level. For morph related memo data see the ACAPI_Element_GetMemo function.
Member Data Documentation
◆ bodyType
 API_MorphType::bodyType
Type of the body (Solid, Surface).
◆ buildingMaterial
 API_MorphType::buildingMaterial
Building Material index of morph's hatch.
◆ castShadow
 API_MorphType::castShadow
Body casts shadow.
◆ coverFillBGPen
 API_MorphType::coverFillBGPen
Floor plan fill background pen.
◆ coverFillOrientation
 API_MorphType::coverFillOrientation
Floor plan local origo type of fill.
◆ coverFillPen
 API_MorphType::coverFillPen
Floor plan fill pen.
◆ coverFillType
 API_MorphType::coverFillType
Floor plan fill type.
◆ cutFillBackgroundPen
 API_MorphType::cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
◆ cutFillPen
 API_MorphType::cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
◆ cutLinePen
 API_MorphType::cutLinePen
Pen of the cut contour.
◆ cutLineType
 API_MorphType::cutLineType
Line Type of the cut contour.
◆ displayOption
 API_MorphType::displayOption
Display options of the element on the floor plan (see API_ElemDisplayOptionsID).
◆ edgeType
 API_MorphType::edgeType
Type of the edge (Soft, Sharp).
◆ head
 API_MorphType::head
General element header.
◆ isAutoOnStoryVisibility
 API_MorphType::isAutoOnStoryVisibility
Is Auto On Story Visibility.
◆ level
 API_MorphType::level
Z position of the free shape.
◆ linkToSettings
 API_MorphType::linkToSettings
Mode of linking to home story.
◆ material
 API_MorphType::material
Material override structure of non customized surfaces.
◆ outlineContourDisplay
 API_MorphType::outlineContourDisplay
Outline Contour Display.
◆ overheadLinePen
 API_MorphType::overheadLinePen
Pen of view above (Floor plan only).
◆ overheadLineType
 API_MorphType::overheadLineType
Line Type of view above (Floor plan only).
◆ receiveShadow
 API_MorphType::receiveShadow
Body receives shadow.
◆ showContour
 API_MorphType::showContour
The option to define which stories display the contour of the morph.
◆ showFill
 API_MorphType::showFill
The option to define which stories display the fill of the morph.
◆ textureProjectionCoords
 API_MorphType::textureProjectionCoords
Texture projection coordinate system.
◆ textureProjectionType
 API_MorphType::textureProjectionType
Projection type of texture.
◆ tranmat
 API_MorphType::tranmat
Tranmat of the morph element.
◆ uncutLinePen
 API_MorphType::uncutLinePen
Pen of the contour.
◆ uncutLineType
 API_MorphType::uncutLineType
Line Type of the contour.
◆ use3DHatching
 API_MorphType::use3DHatching
Floor plan fill from material.
◆ useCoverFillType
 API_MorphType::useCoverFillType
Use Floor plan fill.
◆ useDistortedCoverFill
 API_MorphType::useDistortedCoverFill
Show hatching as projected onto a plane.
◆ viewDepthLimitation
 API_MorphType::viewDepthLimitation
Defines the range within the element is shown on the floor plan (see API_ElemViewDepthLimitationsID).